let aq = 2;
let x = 1 + (a *= 2);
//  aq = 4,x=5

// "" + 1 + 0 =10
// "" - 1 + 0 ="10"
// true + false = 1 так как true =1,а false =0
// 6 / "3" = 2 так как только оператор сложения может преобразовывать строку в число
// "2" * "3" = 6
// 4 + 5 + "px" = "9px"
// "$" + 4 + 5 = "$45"
// "4" - 2=2
// "4px" - 2 = NaN
// "  -9  " + 5 = "-9 5 "
// "  -9  " - 5 = -14
// null + 1 =1
// undefined + 1 = ...
// " \t \n" - 2 =...

//  Здесь всего лишь нужно было вырвжение из string перевести в number.
let a = prompt("Первое число?", 1);
let b = prompt("Второе число?", 2);

console.log(+a + +b);

